experiment/results/omoe/qwen3-30b-a3b/offload_limit_test/20260408_145925_omoe-qwen3_limit25/benchmark.log
[INFO] Log file: /root/autodl-tmp/workspace/experiment/results/omoe/qwen3-30b-a3b/20260408_145925_omoe-qwen3_limit25/benchmark.log
[INFO] Config saved to /root/autodl-tmp/workspace/experiment/results/omoe/qwen3-30b-a3b/20260408_145925_omoe-qwen3_limit25/config.json
[INFO] Checking server availability...
[INFO] Server is ready
[INFO] Model ID: /root/autodl-tmp/models/Qwen3-30B-A3B

>>> ============================================
>>> Benchmark RR=10 req/s
>>> ============================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f72bea1f9c0>, trust_remote_code=False, seed=0, num_prompts=1000, dataset_name='sharegpt', no_stream=False, dataset_path='/root/autodl-tmp/dataset/ShareGPT_V3_unfiltered_cleaned_split.json', no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/root/autodl-tmp/models/Qwen3-30B-A3B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=10.0, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=['framework=omoe,model=qwen3-30b-a3b,request_rate=10'], result_dir='/root/autodl-tmp/workspace/experiment/results/omoe/qwen3-30b-a3b/20260408_145925_omoe-qwen3_limit25/rr_10', result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-9327eeaf-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False)
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 10.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 1000/1000 [04:16<00:00,  3.90it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     1000      
Failed requests:                         0         
Request rate configured (RPS):           10.00     
Benchmark duration (s):                  256.58    
Total input tokens:                      217393    
Total generated tokens:                  201508    
Request throughput (req/s):              3.90      
Output token throughput (tok/s):         785.35    
Peak output token throughput (tok/s):    1280.00   
Peak concurrent requests:                570.00    
Total token throughput (tok/s):          1632.61   
---------------Time to First Token----------------
Mean TTFT (ms):                          18076.73  
Median TTFT (ms):                        8190.47   
P99 TTFT (ms):                           52639.59  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          209.34    
Median TPOT (ms):                        222.49    
P99 TPOT (ms):                           262.05    
---------------Inter-token Latency----------------
Mean ITL (ms):                           210.77    
Median ITL (ms):                         217.27    
P99 ITL (ms):                            301.71    
==================================================
[OK] RR=10 done -> /root/autodl-tmp/workspace/experiment/results/omoe/qwen3-30b-a3b/20260408_145925_omoe-qwen3_limit25/rr_10/result.json

>>> ============================================
>>> Generating summary report...
>>> ============================================
  RR=10.0: throughput=3.90 req/s, TTFT_mean=18076.7ms, TPOT_mean=209.34ms

[OK] Summary saved: /root/autodl-tmp/workspace/experiment/results/omoe/qwen3-30b-a3b/20260408_145925_omoe-qwen3_limit25/summary.json
[OK] Summary MD saved: /root/autodl-tmp/workspace/experiment/results/omoe/qwen3-30b-a3b/20260408_145925_omoe-qwen3_limit25/summary.md

============================================
  All Benchmarks Complete!
============================================
  Results:      /root/autodl-tmp/workspace/experiment/results/omoe/qwen3-30b-a3b/20260408_145925_omoe-qwen3_limit25
  Summary:      /root/autodl-tmp/workspace/experiment/results/omoe/qwen3-30b-a3b/20260408_145925_omoe-qwen3_limit25/summary.json
  Summary MD:   /root/autodl-tmp/workspace/experiment/results/omoe/qwen3-30b-a3b/20260408_145925_omoe-qwen3_limit25/summary.md
============================================